biddr_api/app/controllers/api/v1/auctions_controller.rb

  def show
    @auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def find_auction
    @auction||=Auction.find params[:id]
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]